# SpaceAssocRoomNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceAssocRoomNumber Property
ParameterTypeId Class See Also
---
"Room Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceAssocRoomNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceAssocRoomNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceAssocRoomNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace